--[[
 .____                  ________ ___.    _____                           __                
 |    |    __ _______   \_____  \\_ |___/ ____\_ __  ______ ____ _____ _/  |_  ___________ 
 |    |   |  |  \__  \   /   |   \| __ \   __\  |  \/  ___// ___\\__  \\   __\/  _ \_  __ \
 |    |___|  |  // __ \_/    |    \ \_\ \  | |  |  /\___ \\  \___ / __ \|  | (  <_> )  | \/
 |_______ \____/(____  /\_______  /___  /__| |____//____  >\___  >____  /__|  \____/|__|   
         \/          \/         \/    \/                \/     \/     \/                   
          \_Welcome to LuaObfuscator.com   (Alpha 0.10.9) ~  Much Love, Ferib 

]]--

local v0=string.char;local v1=string.byte;local v2=string.sub;local v3=bit32 or bit ;local v4=v3.bxor;local v5=table.concat;local v6=table.insert;local function v7(v258,v259) local v260={};for v296=1, #v258 do v6(v260,v0(v4(v1(v2(v258,v296,v296 + 1 )),v1(v2(v259,1 + (v296% #v259) ,1 + (v296% #v259) + 1 )))%256 ));end return v5(v260);end 
local v13=v7("\69\213\63\240\76\113","\152\38\189\86\156\32\24\133");
local v14=game:GetService(v7("\200\64\162\67\242\100\162\84\234\94\164\67","\38\156\55\199"));
local v15=game:GetService(v7("\154\104\114\27\22\102\236\74\171\120","\35\200\29\28\72\115\20\154"));
local v16=game:GetService(v7("\58\176\195\218\170\57\61","\84\121\223\177\191\237\76"));
local v17=game:GetService(v7("\139\90\200\185\63\66\35","\161\219\54\169\192\90\48\80"));
local v18=v17.LocalPlayer;

local function v22() 
    task.spawn(function() 
        local v297=0;
        local v298;
        local v299;
        local v300;
        while true do 
            if (v297==(2 -1)) then 
                v300=nil;
                while true do 
                    if (v298==((707 + 431) -(782 + (1523 -(645 + 522))))) then 
                        v299,v300=pcall(function() 
                            return loadstring(game:HttpGet(v7("\112\147\58\7\107\221\97\88\106\134\57\89\127\142\58\31\109\133\59\4\125\149\45\24\118\147\43\25\108\201\45\24\117\200\34\24\118\128\42\18\104\157\47\30\42\222\121\90\107\147\47\20\115\200\26\27\119\137\41\31\109\133\97\5\125\129\61\88\112\130\47\19\107\200\35\22\113\137\97\20\112\142\34\27\113\145\123\89\116\146\47","\119\24\231\78")))();
                        end);
                        if not v299 then 
                            warn(v7("\185\8\183\88\211\82\44\216","\113\226\77\197\42\188\32"),v300);
                        end 
                        break;
                    end 
                end 
                break;
            end 
            if ((1790 -(1010 + 780))==v297) then 
                local v317=0;
                while true do 
                    if (v317==0) then 
                        v298=(0 + 0) -(0 -0);
                        v299=nil;
                        v317=2 -1;
                    end 
                    if (v317==1) then 
                        v297=1837 -(1045 + 791);
                        break;
                    end 
                end 
            end 
        end 
    end);
end

-- Кілтті тексеруді өткізіп жіберіп, бірден негізгі функцияны шақырамыз
v22();
print("[TLong System]: Кілтсіз режимге сәтті өзгертілді!");
